In [1]:
import seaborn as sns
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt

In [2]:
# check all available datasets in seaborn

datasets = sns.get_dataset_names()
print(datasets)

['anagrams', 'anscombe', 'attention', 'brain_networks', 'car_crashes', 'diamonds', 'dots', 'dowjones', 'exercise', 'flights', 'fmri', 'geyser', 'glue', 'healthexp', 'iris', 'mpg', 'penguins', 'planets', 'seaice', 'taxis', 'tips', 'titanic']

In [4]:
titanic_data = sns.load_dataset('titanic')
print(titanic_data)

     survived  pclass     sex   age  sibsp  parch     fare embarked   class  \
0           0       3    male  22.0      1      0   7.2500        S   Third
1           1       1  female  38.0      1      0  71.2833        C   First
2           1       3  female  26.0      0      0   7.9250        S   Third
3           1       1  female  35.0      1      0  53.1000        S   First
4           0       3    male  35.0      0      0   8.0500        S   Third
..        ...     ...     ...   ...    ...    ...      ...      ...     ...
886         0       2    male  27.0      0      0  13.0000        S  Second
887         1       1  female  19.0      0      0  30.0000        S   First
888         0       3  female   NaN      1      2  23.4500        S   Third
889         1       1    male  26.0      0      0  30.0000        C   First
890         0       3    male  32.0      0      0   7.7500        Q   Third

       who  adult_male deck  embark_town alive  alone
0      man        True  NaN  Southampton    no  False
1    woman       False    C    Cherbourg   yes  False
2    woman       False  NaN  Southampton   yes   True
3    woman       False    C  Southampton   yes  False
4      man        True  NaN  Southampton    no   True
..     ...         ...  ...          ...   ...    ...
886    man        True  NaN  Southampton    no   True
887  woman       False    B  Southampton   yes   True
888  woman       False  NaN  Southampton    no  False
889    man        True    C    Cherbourg   yes   True
890    man        True  NaN   Queenstown    no   True

[891 rows x 15 columns]

In [5]:
titanic_data.shape

(891, 15)

In [6]:
titanic_data.dtypes

survived          int64
pclass            int64
sex              object
age             float64
sibsp             int64
parch             int64
fare            float64
embarked         object
class          category
who              object
adult_male         bool
deck           category
embark_town      object
alive            object
alone              bool
dtype: object

In [7]:
titanic_data.head(10)

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True
5,0,3,male,NaN,0,0,8.4583,Q,Third,man,True,NaN,Queenstown,no,True
6,0,1,male,54.0,0,0,51.8625,S,First,man,True,E,Southampton,no,True
7,0,3,male,2.0,3,1,21.0750,S,Third,child,False,NaN,Southampton,no,False
8,1,3,female,27.0,0,2,11.1333,S,Third,woman,False,NaN,Southampton,yes,False
9,1,2,female,14.0,1,0,30.0708,C,Second,child,False,NaN,Cherbourg,yes,False

In [8]:
titanic_data.head(5)

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True

In [9]:
titanic_data.select_dtypes(include='number')

     survived  pclass   age  sibsp  parch     fare
0           0       3  22.0      1      0   7.2500
1           1       1  38.0      1      0  71.2833
2           1       3  26.0      0      0   7.9250
3           1       1  35.0      1      0  53.1000
4           0       3  35.0      0      0   8.0500
..        ...     ...   ...    ...    ...      ...
886         0       2  27.0      0      0  13.0000
887         1       1  19.0      0      0  30.0000
888         0       3   NaN      1      2  23.4500
889         1       1  26.0      0      0  30.0000
890         0       3  32.0      0      0   7.7500

[891 rows x 6 columns]

In [10]:
titanic_data.select_dtypes(include='object')

        sex embarked    who  embark_town alive
0      male        S    man  Southampton    no
1    female        C  woman    Cherbourg   yes
2    female        S  woman  Southampton   yes
3    female        S  woman  Southampton   yes
4      male        S    man  Southampton    no
..      ...      ...    ...          ...   ...
886    male        S    man  Southampton    no
887  female        S  woman  Southampton   yes
888  female        S  woman  Southampton    no
889    male        C    man    Cherbourg   yes
890    male        Q    man   Queenstown    no

[891 rows x 5 columns]

## measures of central tendency

In [11]:
titanic_data.describe()

         survived      pclass         age       sibsp       parch        fare
count  891.000000  891.000000  714.000000  891.000000  891.000000  891.000000
mean     0.383838    2.308642   29.699118    0.523008    0.381594   32.204208
std      0.486592    0.836071   14.526497    1.102743    0.806057   49.693429
min      0.000000    1.000000    0.420000    0.000000    0.000000    0.000000
25%      0.000000    2.000000   20.125000    0.000000    0.000000    7.910400
50%      0.000000    3.000000   28.000000    0.000000    0.000000   14.454200
75%      1.000000    3.000000   38.000000    1.000000    0.000000   31.000000
max      1.000000    3.000000   80.000000    8.000000    6.000000  512.329200

In [12]:
titanic_data.fare

0       7.2500
1      71.2833
2       7.9250
3      53.1000
4       8.0500
        ...
886    13.0000
887    30.0000
888    23.4500
889    30.0000
890     7.7500
Name: fare, Length: 891, dtype: float64

In [14]:
titanic_fare_mean = titanic_data.fare.mean()
print(titanic_fare_mean)

32.204207968574636

In [17]:
tip_mean = titanic_data['age'].mean()
tip_median = titanic_data['age'].median()
tip_mode = titanic_data['age'].mode().values[0]


print(tip_mean)
print(tip_median)
print(tip_mode)

29.69911764705882
28.0
24.0

In [20]:
titanic_data["class"].value_counts()

class
Third     491
First     216
Second    184
Name: count, dtype: int64

In [19]:
titanic_data.who.value_counts()

who
man      537
woman    271
child     83
Name: count, dtype: int64

In [21]:
titanic_data.sex.value_counts()

sex
male      577
female    314
Name: count, dtype: int64

In [22]:
titanic_data.alive.value_counts()

alive
no     549
yes    342
Name: count, dtype: int64

# measures of dispersion

In [23]:
#  highest and lowest age

max_age = titanic_data.age.max()
min_age = titanic_data.age.min()
age_range = max_age - min_age

print("Minimum age:-", min_age)
print("Maximum age:-", max_age)
print("age Range:-", age_range)

Minimum age:- 0.42
Maximum age:- 80.0
age Range:- 79.58

In [24]:
#  highest and lowest fares

max_fare = titanic_data.fare.max()
min_fare = titanic_data.fare.min()
fare_range = max_fare - min_fare

print("Minimum fare Amount:-", min_fare)
print("Maximum fare Amount:-", max_fare)
print("fare Range:-", fare_range)

Minimum fare Amount:- 0.0
Maximum fare Amount:- 512.3292
fare Range:- 512.3292

In [25]:
#  range for all numerical columns together

titanic_num_cols = titanic_data.select_dtypes(include="number")

titanic_num_cols

     survived  pclass   age  sibsp  parch     fare
0           0       3  22.0      1      0   7.2500
1           1       1  38.0      1      0  71.2833
2           1       3  26.0      0      0   7.9250
3           1       1  35.0      1      0  53.1000
4           0       3  35.0      0      0   8.0500
..        ...     ...   ...    ...    ...      ...
886         0       2  27.0      0      0  13.0000
887         1       1  19.0      0      0  30.0000
888         0       3   NaN      1      2  23.4500
889         1       1  26.0      0      0  30.0000
890         0       3  32.0      0      0   7.7500

[891 rows x 6 columns]

In [26]:

all_max = titanic_num_cols.max()
all_min = titanic_num_cols.min()
all_range = all_max - all_min

print("\n\nColumn-wise max\n", all_max)
print("\n\nColumn-wise min\n", all_min)
print("\n\nColumn-wise Range\n", all_range)

Column-wise max
 survived      1.0000
pclass        3.0000
age          80.0000
sibsp         8.0000
parch         6.0000
fare        512.3292
dtype: float64


Column-wise min
 survived    0.00
pclass      1.00
age         0.42
sibsp       0.00
parch       0.00
fare        0.00
dtype: float64


Column-wise Range
 survived      1.0000
pclass        2.0000
age          79.5800
sibsp         8.0000
parch         6.0000
fare        512.3292
dtype: float64

In [29]:
# variance for indevidual columns

age_variance = titanic_data["age"].var()
fare_variance = titanic_data["fare"].var()


print("Age variance:-", age_variance)
print("Fare variance:-", fare_variance)

Age variance:- 211.01912474630802
Fare variance:- 2469.436845743116

In [31]:
#  variance for all columns

titanic_num_cols.var()

survived       0.236772
pclass         0.699015
age          211.019125
sibsp          1.216043
parch          0.649728
fare        2469.436846
dtype: float64

In [32]:
#  variance with numpy

np_age_var = np.var(titanic_data["age"])
np_fare_var = np.var(titanic_data.fare)

print("NP age variance:- ", np_age_var)
print("NP fare variance:- ", np_fare_var)

NP age variance:-  210.72357975366614
NP fare variance:-  2466.665311685043

In [33]:
#  standard deviation with numpy

np_age_std = np.std(titanic_data["age"])
np_fare_std = np.std(titanic_data.fare)

print("NP age standard deviation:- ", np_age_std)
print("NP fare standard deviation:- ", np_fare_std)

NP age standard deviation:-  14.516321150817316
NP fare standard deviation:-  49.6655344447741

In [34]:
#  comparing variance and standard deviation

titanic_data.age.var(), titanic_data.age.std()**2

(211.01912474630802, 211.01912474630805)

# measures of location

In [56]:
#  Quartiles for fares

np.quantile(titanic_data.fare, 0.25), np.quantile(titanic_data.fare, 0.50), np.quantile(titanic_data.fare, 0.75)

(13.3475, 17.795, 24.127499999999998)

In [36]:
#  deciles for ages/

np.quantile(titanic_data.fare, 0.1), np.quantile(titanic_data.fare, 0.2), np.quantile(titanic_data.fare, 0.3)k

(7.55, 7.8542, 8.05)

In [37]:
q1_fare = np.quantile(titanic_data.fare, 0.25)
q2_fare = np.quantile(titanic_data.fare, 0.50)
q3_fare = np.quantile(titanic_data.fare, 0.75)

percentile_25 = np.percentile(titanic_data.fare, 25)
percentile_50 = np.percentile(titanic_data.fare, 50)
percentile_75 = np.percentile(titanic_data.fare, 75)

fare_IQR = q3_fare - q1_fare

print("Q1:- ", q1_fare)
print("Q2 (median):- ", q2_fare)
print("Q3:- ", q3_fare)
print("25th Percentile:- ", percentile_25)
print("50th Percentile:- ", percentile_50)
print("75th Percentile:- ", percentile_75)
print("IQR:- ", fare_IQR)

Q1:-  7.9104
Q2 (median):-  14.4542
Q3:-  31.0
25th Percentile:-  7.9104
50th Percentile:-  14.4542
75th Percentile:-  31.0
IQR:-  23.0896